Revit 2027 API
SiteSubRegion.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>) | Obsolete.
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList<CurveLoop>, ElementId) | Obsolete.
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Top
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace